/* . Найти произведение первых пяти натуральных чисел (от 1 до 5).
Чтобы решить задачу, нужно вспомнить, что роль нуля в умножении играет единица, то есть число(1 = 1(число = число для любого числа.
Следовательно, в программе про сумму остается заменить 0 на 1, "+" на "*", 
и поменять обозначения, вместо "сумма" использовать "произв". Получим

*/

#include <stdio.h>
int main()
{
	
	int proiz = 1;
	for (int k = 1; k <= 5; k++)
	{
		proiz = proiz * k;
	}
	printf("%d",proiz);

	
}
