// 7Begin4±. Дан диаметр окружности d. Найти ее длину L = ¼d. В качестве значения ¼ использовать 3.14.

#include <stdio.h>
int main()
{
    double pi = 3.14; //тип данных(число пи десятичное)
    int t; // тип данных( диаметр целые)
    double length; // тип данных(длина десятичные)
    printf("Введите диаметр окружности "); // выводит текст 
    scanf("%d",&t); // ввод пользователя
    length = t * pi; // длина окружности = диаметр * число пи
    printf("Длина окружности  = %f",length); // выводит текст и длину окружности
    

}