// Begin5±. Дана длина ребра куба a. Найти объем куба V = a3 и площадь его поверхности S = 6a2.

#include <stdio.h>
int main()
{
    int a,v,s; // //тип данных(целые)
    printf("Введите длину ребра "); // вывод текста
    scanf("%d",&a); // ввод данных от пользователя(ребра)
    v = a * a * a; // объем = ребро * ребро * ребро
    s = 6 * (a * a); // Площадь поверхности = 6 сторон * (ребро * ребро)
    printf("Объем куба = %d ,Площадь поверхности = %d ",v,s);  // вывод текста а именно объем,площадь поверхности
}