// Begin6±. Даны длины ребер a, b, c прямоугольного параллелепипеда. Найти его объем V = abc и площадь поверхности S = 2(ab + bc + ac).

#include <stdio.h>
int main()

{

int a,b,c,v,s; // //тип данных(целые)
printf("Введите длину сторон "); // вывод текста
scanf("%d%d%d",&a,&b,&c); // ввод данных от пользователя
v = a * b * c; // объем = умножение 3 сторон
s = 2 *(a * b + b * c + a * c); // нахождение площади поверхности
printf("Объем  = %d ,Площадь поверхности = %d ",v,s);  // вывод текста а именно объем,площадь поверхности

}

